In [2]:
import numpy as np
import pandas as pd

In [ ]:
# stack() : 열 index 를 행 index 로 전환
# unstack() : 행 index 를 열 index 로 전환
# reset_index() : 기존의 행 index 제거, 선두 데이터 열로 추가
# set_index() : 기존의 행 index 제거, 데이터 열 중 하나를 index 로 설정

In [4]:
df1 = pd.DataFrame([[0,1],[2,3]], index=['a','b'], columns = ['x','y'])
df1

   x  y
a  0  1
b  2  3

In [5]:
# 열 index (x, y) 를 행으로 바꿔줌

df1.stack()

a  x    0
   y    1
b  x    2
   y    3
dtype: int64

In [6]:
# 행 index (a, b) 를 열로 바꿔줌

df1.unstack()

x  a    0
   b    2
y  a    1
   b    3
dtype: int64

In [8]:
df2 = pd.DataFrame([('A',300),('B',24),('C',80),('D',np.nan)], index=['aa','bb','cc','dd'], columns=('type','speed'))
df2

   type  speed
aa    A  300.0
bb    B   24.0
cc    C   80.0
dd    D    NaN

In [10]:
# 색인 재설정

df2.reset_index()

  index type  speed
0    aa    A  300.0
1    bb    B   24.0
2    cc    C   80.0
3    dd    D    NaN

In [11]:
# 색인 삭제

df2.reset_index(drop=True)

  type  speed
0    A  300.0
1    B   24.0
2    C   80.0
3    D    NaN

In [13]:
df3 = pd.DataFrame({'month':[1,4,5,10],
                   'year':[2010,2012,2013,2012],
                   'sale':[55,40,84,33]})
df3

   month  year  sale
0      1  2010    55
1      4  2012    40
2      5  2013    84
3     10  2012    33

In [14]:
# month 로 인덱스 만들기

df3.set_index('month')

       year  sale
month
1      2010    55
4      2012    40
5      2013    84
10     2012    33

In [15]:
# year, month 로 다중 인덱스

df3.set_index(['year','month'])

            sale
year month
2010 1        55
2012 4        40
2013 5        84
2012 10       33

In [16]:
# 숫자 인덱스도 하고, year 도 쓰기

df3.set_index([[1,2,3,4],'year'])

        month  sale
  year
1 2010      1    55
2 2012      4    40
3 2013      5    84
4 2012     10    33